var DOC;
if(!DOC) DOC = [];

Array.prototype.push.apply(DOC, [
	{
		type: "section",
		title: "妖魔擴充規則",
		entries: [
			{ type: "note", text: "出自《流派ブック 隠忍の血統》" },
			"這個追加規則是與妖魔相關的擴充。",
			{
				type: "section",
				title: "異形表",
				entries: [
					"若使用了本書記載的妖魔擴充規則，則當角色進行「妖魔化」時，將改為擲骰 1D6 使用「新異形表」來決定會發現什麼樣的效果。透過這個方式被發現的效果被稱為「異形」。異形共有六種型態，分別是：異靈態、凶身態、神化態、攻激態、業魔態、不視態。",
					"當進行了妖魔化，角色必須把其發現的異形名稱紀錄在角色卡的背景欄上。若因為該異形的效果而修得了任何妖魔忍法，則把該忍法的名稱一併紀錄在異形種類後。即使種類相同，但若因此修得的妖魔忍法不同，就會被視為不同的異形。",
					"在進行妖魔化時，除了使用「新異形表」決定會新發現什麼異形之外，還會一併發現過去妖魔化時曾經發現過的所有異形。倘若這時新發現的異形與過去異形重複，則重新擲骰使用「新異形表」，直到發現不同的異形為止。",
					{
						type: "table",
						caption: "● 新異形表 1D6",
						colStyles: [ "", "" ],
						rows: [
							[ "" ],
							[ "1", "異靈態。使用「妖魔忍法表‧異靈」。在妖魔化期間，修得該妖魔忍法。" ],
							[ "2", "凶身態。使用「妖魔忍法表‧凶身」。在妖魔化期間，修得該妖魔忍法。" ],
							[ "3", "神化態。使用「妖魔忍法表‧神化」。在妖魔化期間，修得該妖魔忍法。" ],
							[ "4", "攻激態。使用「妖魔忍法表‧攻激」。在妖魔化期間，修得該妖魔忍法。" ],
							[ "5", "業魔態。在妖魔化期間，在戰鬥中，每輪可以使用的忍法總花費為自己的謀位+3，\n並修得裝備忍法【搖音】。" ],
							[ "6", "不視態。在妖魔化期間，對此角色攻擊的迴避判定、以及對此角色奧義的看破判定，都有-1修正。" ],
						],
					}
				]
			},
			{
				type: "section",
				title: "妖魔忍法表",
				entries: [
					"若使用了本書記載的妖魔擴充規則，則當角色因為妖魔化而要隨機修得妖魔忍法時，將改為擲骰1D6使用新的「妖魔忍法表」來決定會修得什麼妖魔忍法。",
					"「妖魔忍法表」上的每個擲骰結果都有各自對應的二種妖魔忍法，使用者將需要從這兩種妖魔忍法中任意選擇一個並修得。然而，同名的忍法一樣不能重複修得。如果角色已經修得了這兩種妖魔忍法的其中一個，則他將只能選擇並修得另一個。倘若兩種妖魔忍法都已經修得，則重新骰「新異形表」來決定新的異形。",
					{
						type: "flex",
						entries: [
							{
								type: "table",
								caption: "● 妖魔忍法表．異靈",
								colStyles: [ "", "width:100px", "width:120px" ],
								rows: [
									[ "" ],
									[ "1", "【逢魔時】", "【虛舟】" ],
									[ "2", "【神隱】", "【食夢】" ],
									[ "3", "【狂骨】", "【金毛】" ],
									[ "4", "【木魂】", "【朽繩】" ],
									[ "5", "【付喪神】", "【香魂】" ],
									[ "6", "【生剝】", "【三屍】" ],
								],
							},
							{
								type: "table",
								caption: "● 妖魔忍法表．神化",
								colStyles: [ "", "width:100px", "width:120px" ],
								rows: [
									[ "" ],
									[ "1", "【鵺】", "【朱盤】" ],
									[ "2", "【野衾】", "【長壁】" ],
									[ "3", "【震震】", "【物氣】" ],
									[ "4", "【見越】", "【紙舞】" ],
									[ "5", "【夜雀】", "【目競】" ],
									[ "6", "【獵犬】", "【置行】" ],
								],
							},
							{
								type: "table",
								caption: "● 妖魔忍法表．凶身",
								colStyles: [ "", "width:100px", "width:120px" ],
								rows: [
									[ "" ],
									[ "1", "【荒吐】", "【赤舌】" ],
									[ "2", "【鬼火】", "【大太郎】" ],
									[ "3", "【怨靈】", "【白面】" ],
									[ "4", "【吞口】", "【邪魅】" ],
									[ "5", "【百眼】", "【鬼胎】" ],
									[ "6", "【蛭子】", "【岩肌】" ],
								],
							},
							{
								type: "table",
								caption: "● 妖魔忍法表．攻激",
								colStyles: [ "", "width:100px", "width:120px" ],
								rows: [
									[ "" ],
									[ "1", "【黑手】", "【強威】" ],
									[ "2", "【業弓】", "【強威】" ],
									[ "3", "【怪病】", "【強威】" ],
									[ "4", "【鏖殺】", "【強威】" ],
									[ "5", "【精靈風】", "【強威】" ],
									[ "6", "【雷獸】", "【強威】" ],
								],
							}
						]
					},
				]
			},
		],
	},
	{
		type: "section",
		title: "妖術戰傷害",
		entries: [
			{ type: "note", text: "出自《流派ブック 隠忍の血統》" },
		],
	},
	{
		type: "section",
		title: "鬼力",
		entries: [
			{ type: "note", text: "出自《流派ブック 隠忍の血統》" },
		],
	},
	{
		type: "section",
		title: "出島",
		entries: [
			{ type: "note", text: "出自《流派ブック 隠忍の血統》" },
			"(待補充)"
		],
	},
]);