var DOC;
if(!DOC) DOC = [];

Array.prototype.push.apply(DOC, [
	{
		type: "section",
		title: "斜齒系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 斜齒忍軍》" },
			{
				type: "table",
				caption: "斜齒系名稱決定表 1D6",
				bodyClass: "fullWidth",
				colStyles: [ "width:10px", "", "width:10px;border-left:1px dotted black", "" ],
				rows: [
					[ "" ],
					[ "1", "道具系姓氏表 + 斜齒名字表．甲", "4", "道具系姓氏表 + 斜齒名字表．乙" ],
					[ "2", "技術系姓氏表 + 斜齒名字表．甲", "5", "技術系姓氏表 + 斜齒名字表．乙" ],
					[ "3", "名工系姓氏表 + 斜齒名字表．甲", "6", "名工系姓氏表 + 斜齒名字表．乙" ],
				],
			},
			{
				type: "section",
				title: "斜齒姓氏表",
				entries: []
			},
			{
				type: "table",
				caption: "道具系姓氏表 D66",
				bodyStyle: "font-size:0.9rem",
				colStyles: [ "", "width:130px", "", "width:130px", "", "width:130px" ],
				rows: [
					[ "" ],
					[ "11", "金梃／かなてこ", "23", "指矩／さしがね", "36", "釘拔／くぎぬき" ],
					[ "12", "錣／しころ", "24", "玄翁／げんのう", "44", "糸鋸／いとのこ" ],
					[ "13", "平鍬／ひらくわ", "25", "大槌／おおづち", "45", "砥石／といし" ],
					[ "14", "坪錐／つぼきり", "26", "立鉋／たちがんな", "46", "浮造／うづくり" ],
					[ "15", "鎹／かすがい", "33", "金床／かなとこ", "55", "万力／まんりき" ],
					[ "16", "砧／きぬた", "34", "墨壺／すみつぼ", "56", "鍔鑋／つばのみ" ],
					[ "22", "五德／ごとく", "35", "鶴嘴／つるはし", "66", "鑄型／いがた" ],
				],
			},
			{
				type: "table",
				caption: "技術系姓氏表 D66",
				bodyStyle: "font-size:0.9rem",
				colStyles: [ "", "width:130px", "", "width:130px", "", "width:130px" ],
				rows: [
					[ "" ],
					[ "11", "柄卷／つかまき", "23", "一文字／いちもんじ", "36", "踏鞴／たたら" ],
					[ "12", "鞘師／さやし", "24", "釘／くぎ", "44", "鎬／しのぎ" ],
					[ "13", "笠木／かさぎ", "25", "大引／おおびき", "45", "金輪／かなわ" ],
					[ "14", "竿緣／さおぶち", "26", "切妻／きりづま", "46", "仇折／あだおり" ],
					[ "15", "雛形／ひながた", "33", "水壓／みずへし", "55", "引鐵／ひきがね" ],
					[ "16", "玉鋼／たまはがね", "34", "合印／あいじるし", "56", "鬼瓦／おにがわら" ],
					[ "22", "巣口／すぐち", "35", "齒車／はぐるま", "66", "火造／ひづくり" ],
				],
			},
			{
				type: "table",
				caption: "名工系姓氏表 D66",
				bodyStyle: "font-size:0.9rem",
				colStyles: [ "", "width:130px", "", "width:130px", "", "width:130px" ],
				rows: [
					[ "" ],
					[ "11", "本阿彌／ほんあみ", "23", "八板／やいた", "36", "意刀／いとう" ],
					[ "12", "芝辻／しばつじ", "24", "邑田／むらた", "44", "青江／あおえ" ],
					[ "13", "國友／くにとも", "25", "宮田／みやた", "45", "牛王／ごおう" ],
					[ "14", "鈴木／すずき", "26", "千代鶴／ちよづる", "46", "吉原／よしはら" ],
					[ "15", "芝辻／しばつじ", "33", "正宗／まさむね", "55", "芹澤／せりざわ" ],
					[ "16", "守屋／もりや", "34", "山浦／やまうら", "56", "黑潮／くろしお" ],
					[ "22", "平賀／ひらが", "35", "玉屋／たまや", "66", "種子島／たねがしま" ],
				],
			},
			{
				type: "section",
				title: "斜齒名字表",
				entries: []
			},
			{
				type: "table",
				caption: "斜齒名字表．甲 D66",
				bodyStyle: "font-size:0.9rem",
				colStyles: [ "", "width:200px", "", "width:200px"],
				rows: [
					[ "" ],
					[ "11", "以數字為原形的名字\n例：二三式、十五、七三", "33", "傀儡、久久津／クグツ\n瑠璃、留利／ルリ" ],
					[ "12", "鋼、刃金／ハガネ\n黃金、狐鐘／コガネ", "34", "四分一、澀市／シブイチ\n佐波理、沙梁／サハリ" ],
					[ "13", "發條、羽根／バネ\n螺絲、捻／ネジ", "35", "爐吠、路傍／ロボ\n視、美瑠／ミル" ],
					[ "14", "錻、武力／ブリキ\n楔、草毘／クサビ", "36", "蒸氣、城樹／ジョウキ\n越列機、惠曆／エレキ" ],
					[ "15", "巧、匠／タクミ\n才、彩／サイ", "44", "勉、努／ツトム\n極、究／キワミ" ],
					[ "16", "竹、嶽／タケ\n麻、朝／アサ", "45", "油、亞武羅／アブラ\n炭、澄／スミ" ],
					[ "22", "倍男、媒緒／バイオ\n輝驅乃、手駒腦／テクノ", "46", "回路、海路／カイロ\n輪狗、凜空／ミリ" ],
					[ "23", "十斗／ジュウト\n絹、鬼怒／キヌ", "55", "百、經久人／ヘクト\n粍、美里／ミリ" ],
					[ "24", "護謨、吾夢／ゴム\n硝子、雅羅主／ガラス", "56", "無銘、霧迷／ムメイ\n鑢、泰梨／ヤスリ" ],
					[ "25", "鈦、千鍛／チタン\n鋁、有海／アルミ", "66", "剎那、雪無／セツナ\n塵、菜乃／ナノ" ],
					[ "26", "格魯謨、黑霧／クロム\n錫、鈴／スズ", "", "" ]
				],
			},
			{
				type: "table",
				caption: "斜齒名字表．乙 D66",
				bodyStyle: "font-size:0.9rem",
				colStyles: [ "", "width:200px", "", "width:200px"],
				rows: [
					[ "" ],
					[ "11", "亞人夢、有都夢／アトム\n零、玲／レイ", "33", "大助、太介／ダイスケ\n銘、明／メイ" ],
					[ "12", "雷電、儡傳／ライデン\n千束、知聰／チサト", "34", "高千穗、高知帆／タカチホ\n哀、愛／アイ" ],
					[ "13", "迅鐵、刃哲／ジンテツ\n似鳥、丹取／ニトリ", "35", "干狩、秘獵／ヒガリ\n置歲、千登世／チトセ" ],
					[ "14", "外印、戲隱／ゲイン\n凜、臨／リン", "36", "光弘、滿廣／ミツヒロ\n由美、遊水／ユミ" ],
					[ "15", "正太郎、庄多郎／ショウタロウ\n花子、華子／ハナコ", "44", "八百喜、彌起／ヤオキ\n紅莉栖、栗朱／クリス" ],
					[ "16", "晃三、構造／コウゾウ\n律子、理津子／リツコ", "45", "襟彌、英理也／エリヤ\n珠世、彈代／タマヨ" ],
					[ "22", "博士、葉可瀨／ハカセ\n聖、秘知／ヒジリ", "46", "弘、宙／ヒロシ\n櫻子、咲樂子／サクラコ" ],
					[ "23", "成行、鳴之／ナリユキ\n春生、晴美／ハルミ", "55", "丈、錠／ジョー\n澪、美緒／ミオ" ],
					[ "24", "創一、惣市／ソウイチ\n聰美、里見／サトミ", "56", "亂數、來夢駄／ラムダ\n理科、利香／リカ" ],
					[ "25", "鐵齋、徹哉／テッサイ\n發女、初目／ハツメ", "66", "○○衛門／○○エモン\n例：五衛門、吉右衛門" ],
					[ "26", "昴、澄春／スバル\n理央、里櫻／リオ", "", "" ]
				],
			}
		],
	},
	{
		type: "section",
		title: "鞍馬系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 鞍馬神流》" },
		],
	},
	{
		type: "section",
		title: "離群系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック ハグレモノ》" },
		],
	},
	{
		type: "section",
		title: "比良坂系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 比良坂機関》" },
		],
	},
	{
		type: "section",
		title: "御齋學園系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 私立御斎学園》" },
			"在創建隸屬私立御齋學園、或與其相關的角色時，可以使用「御齋學園系名稱決定表」隨機決定角色的姓氏和名字。請在沒有命名靈感的時候多加使用。",
			"(略)",
			{
				type: "table",
				caption: "御齋學園系名稱決定表 1D6",
				bodyClass: "fullWidth",
				colStyles: [ "width:10px", "", "width:10px;border-left:1px dotted black", "" ],
				rows: [
					[ "" ],
					[ "1", "大人物家系姓氏表 + 御齋名字表．甲", "4", "大人物家系姓氏表 + 御齋名字表．乙" ],
					[ "2", "學者系姓氏表　　 + 御齋名字表．甲", "5", "學者系姓氏表　　 + 御齋名字表．乙" ],
					[ "3", "文豪系姓氏表　　 + 御齋名字表．甲", "6", "文豪系姓氏表　　 + 御齋名字表．乙" ],
				],
			},
			{
				type: "table",
				caption: "大人物家系姓氏表 D66",
				colStyles: [ "", "width:120px", "", "width:120px", "", "width:120px" ],
				rows: [
					[ "" ],
					[ "11", "瀧崎／たきざき", "23", "伊庭／いば", "36", "栗山／くりやま" ],
					[ "12", "涉澤／しぶさわ", "24", "船越／", "44", "小此木／" ],
					[ "13", "桂／", "25", "麻生／", "45", "小泉／" ],
					[ "14", "鮫島／", "26", "鍵田／", "46", "田沼／" ],
					[ "15", "伊集院／", "33", "京極／", "55", "榊原／" ],
					[ "16", "岩崎／", "34", "服部／", "56", "柳井／" ],
					[ "22", "南条／", "35", "天野／", "66", "毒島／" ],
				],
			},
		],
	},
	{
		type: "section",
		title: "隱忍系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 隠忍の血統》" },
		],
	},
]);