var DOC;
if(!DOC) DOC = [];

Array.prototype.push.apply(DOC, [
	{
		type: "section",
		title: "斜齒系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 斜齒忍軍》" },
		],
	},
	{
		type: "section",
		title: "鞍馬系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 鞍馬神流》" },
		],
	},
	{
		type: "section",
		title: "離群系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック ハグレモノ》" },
		],
	},
	{
		type: "section",
		title: "比良坂系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 比良坂機関》" },
		],
	},
	{
		type: "section",
		title: "御齋學園系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 私立御斎学園》" },
			"在創建隸屬私立御齋學園、或與其相關的角色時，可以使用「御齋學園系名稱決定表」隨機決定角色的姓氏和名字。請在沒有命名靈感的時候多加使用。",
			"(略)",
			{
				type: "table",
				caption: "御齋學園系名稱決定表 1D6",
				colStyles: [ "text-align:center", "" ],
				rows: [
					[ "" ],
					[ "1", "大人物家系姓氏表 + 御齋名字表．甲" ],
					[ "2", "學者系姓氏表　　 + 御齋名字表．甲" ],
					[ "3", "文豪系姓氏表　　 + 御齋名字表．甲" ],
					[ "4", "大人物家系姓氏表 + 御齋名字表．乙" ],
					[ "5", "學者系姓氏表　　 + 御齋名字表．乙" ],
					[ "6", "文豪系姓氏表　　 + 御齋名字表．乙" ],
				],
			},
			{
				type: "table",
				caption: "大人物家系姓氏表 D66",
				colStyles: [ "", "width:120px", "", "width:120px", "", "width:120px" ],
				rows: [
					[ "" ],
					[ "11", "瀧崎／たきざき", "23", "伊庭／いば", "36", "栗山／くりやま" ],
					[ "12", "涉澤／しぶさわ", "24", "船越／", "44", "小此木／" ],
					[ "13", "桂／", "25", "麻生／", "45", "小泉／" ],
					[ "14", "鮫島／", "26", "鍵田／", "46", "田沼／" ],
					[ "15", "伊集院／", "33", "京極／", "55", "榊原／" ],
					[ "16", "岩崎／", "34", "服部／", "56", "柳井／" ],
					[ "22", "南条／", "35", "天野／", "66", "毒島／" ],
				],
			},
		],
	},
	{
		type: "section",
		title: "隱忍系名稱決定表",
		entries: [
			{ type: "note", text: "出自《流派ブック 隠忍の血統》" },
		],
	},
]);